zohar123/ametal/soc/nxp/lpc824/lpc82x_pin.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2015 Guangzhou ZHIYUAN Electronics Stock Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
* e-mail:      ametal.support@zlg.cn
*******************************************************************************/

/**
 * \file
 * \brief LPC82x 引脚及配置参数定义
 * 
 * \note 1. 可转移功能可以配置所有I/O引脚；
 *          GPIO功能和特殊功能属于固定功能，只能搭配对应的引脚使用 \n
 *          示例：PIO0_0引脚功能配置： \n 
 *          - 配置为GPIO功能使用宏：      PIO0_0_GPIO \n
 *          - 配置为比较器输入功能使用宏：PIO0_0_ACMP_I1 \n
 *          - 配置串口发送引脚功能使用宏：PIO_FUNC_U0_TXD
 *
 * \note 2. 复用功能方向由自身决定，PIOx_x_GPIO_INPUT或PIOx_x_GPIO_OUTPUT
 *          会将引脚配置为普通IO输入输出功能 
 *
 * \internal
 * \par Modification History
 * - 1.01 15-11-24  mem, modified.
 * - 1.02 15-07-28  zxl, modified.
 * - 1.00 15-07-08  zxl, first implementation.
 * \endinternal
 */

#ifndef __LPC82X_PIN_H
#define __LPC82X_PIN_H

#include "am_lpc82x_gpio_util.h"

#ifdef PIN_OUTSET
    #include "am_lpc82x_pin_outset.h"
#endif

#ifdef __cplusplus
extern "C" {
#endif

 /** 
 * \addtogroup lpc82x_if_pin
 * \copydoc lpc82x_pin.h
 * @{
 */

/** 
 * \name LPC8xx 引脚编号
 * @{
 */

#define PIO0_0          0        /**< \brief PIO0_0 引脚号 */
#define PIO0_1          1        /**< \brief PIO0_1 引脚号 */
#define PIO0_2          2        /**< \brief PIO0_2 引脚号 */
#define PIO0_3          3        /**< \brief PIO0_3 引脚号 */
#define PIO0_4          4        /**< \brief PIO0_4 引脚号 */
#define PIO0_5          5        /**< \brief PIO0_5 引脚号 */
#define PIO0_6          6        /**< \brief PIO0_6 引脚号 */
#define PIO0_7          7        /**< \brief PIO0_7 引脚号 */
#define PIO0_8          8        /**< \brief PIO0_8 引脚号 */
#define PIO0_9          9        /**< \brief PIO0_9 引脚号 */
#define PIO0_10         10       /**< \brief PIO0_10引脚号 */
#define PIO0_11         11       /**< \brief PIO0_11引脚号 */
#define PIO0_12         12       /**< \brief PIO0_12引脚号 */
#define PIO0_13         13       /**< \brief PIO0_13引脚号 */
#define PIO0_14         14       /**< \brief PIO0_14引脚号 */
#define PIO0_15         15       /**< \brief PIO0_15引脚号 */
#define PIO0_16         16       /**< \brief PIO0_16引脚号 */
#define PIO0_17         17       /**< \brief PIO0_17引脚号 */
#define PIO0_18         18       /**< \brief PIO0_18引脚号 */
#define PIO0_19         19       /**< \brief PIO0_19引脚号 */
#define PIO0_20         20       /**< \brief PIO0_20引脚号 */
#define PIO0_21         21       /**< \brief PIO0_21引脚号 */
#define PIO0_22         22       /**< \brief PIO0_22引脚号 */
#define PIO0_23         23       /**< \brief PIO0_23引脚号 */
#define PIO0_24         24       /**< \brief PIO0_24引脚号 */
#define PIO0_25         25       /**< \brief PIO0_25引脚号 */
#define PIO0_26         26       /**< \brief PIO0_26引脚号 */
#define PIO0_27         27       /**< \brief PIO0_27引脚号 */
#define PIO0_28         28       /**< \brief PIO0_28引脚号 */

/** @} */

/** 
 * \name LPC82x 引脚数
 * @{
 */
 
/** \brief 支持最大引脚数是29 */
#define LPC82X_PIN_NUM         29

/** @} */
 
/** 
 * \name LPC82x 引脚可转移功能
 *
 * 每个I/O引脚都可配置为以下功能
 *
 * @{
 */

/** \brief UART0_TXD  功能 */
#define PIO_FUNC_U0_TXD          AM_LPC82X_GPIO_FUNC_U0_TXD

/** \brief UART0_RXD  功能 */
#define PIO_FUNC_U0_RXD          AM_LPC82X_GPIO_FUNC_U0_RXD

/** \brief UART0_RTS  功能 */
#define PIO_FUNC_U0_RTS          AM_LPC82X_GPIO_FUNC_U0_RTS

/** \brief UART0_CTS  功能 */
#define PIO_FUNC_U0_CTS          AM_LPC82X_GPIO_FUNC_U0_CTS

/** \brief UART0_SCLK 功能 */
#define PIO_FUNC_U0_SCLK         AM_LPC82X_GPIO_FUNC_U0_SCLK

/** \brief UART1_TXD  功能 */
#define PIO_FUNC_U1_TXD          AM_LPC82X_GPIO_FUNC_U1_TXD

/** \brief UART1_RXD  功能 */
#define PIO_FUNC_U1_RXD          AM_LPC82X_GPIO_FUNC_U1_RXD

/** \brief UART1_RTS  功能 */
#define PIO_FUNC_U1_RTS          AM_LPC82X_GPIO_FUNC_U1_RTS

/** \brief UART1_CTS  功能 */
#define PIO_FUNC_U1_CTS          AM_LPC82X_GPIO_FUNC_U1_CTS

/** \brief UART1_SCLK 功能 */
#define PIO_FUNC_U1_SCLK         AM_LPC82X_GPIO_FUNC_U1_SCLK

/** \brief UART2_TXD  功能 */
#define PIO_FUNC_U2_TXD          AM_LPC82X_GPIO_FUNC_U2_TXD

/** \brief UART2_RXD  功能 */
#define PIO_FUNC_U2_RXD          AM_LPC82X_GPIO_FUNC_U2_RXD

/** \brief UART2_RTS  功能 */
#define PIO_FUNC_U2_RTS          AM_LPC82X_GPIO_FUNC_U2_RTS

/** \brief UART2_CTS  功能 */
#define PIO_FUNC_U2_CTS          AM_LPC82X_GPIO_FUNC_U2_CTS

/** \brief UART2_SCLK 功能 */
#define PIO_FUNC_U2_SCLK         AM_LPC82X_GPIO_FUNC_U2_SCLK

/** \brief SPI0_SCK   功能 */
#define PIO_FUNC_SPI0_SCK        AM_LPC82X_GPIO_FUNC_SPI0_SCK

/** \brief SPI0_MOSI  功能 */
#define PIO_FUNC_SPI0_MOSI       AM_LPC82X_GPIO_FUNC_SPI0_MOSI

/** \brief SPI0_MISO  功能 */
#define PIO_FUNC_SPI0_MISO       AM_LPC82X_GPIO_FUNC_SPI0_MISO

/** \brief SPI0_SSEL0 功能 */
#define PIO_FUNC_SPI0_SSEL0      AM_LPC82X_GPIO_FUNC_SPI0_SSEL0

/** \brief SPI0_SSEL1 功能 */
#define PIO_FUNC_SPI0_SSEL1      AM_LPC82X_GPIO_FUNC_SPI0_SSEL1

/** \brief SPI0_SSEL2 功能 */
#define PIO_FUNC_SPI0_SSEL2      AM_LPC82X_GPIO_FUNC_SPI0_SSEL2

/** \brief SPI0_SSEL3 功能 */
#define PIO_FUNC_SPI0_SSEL3      AM_LPC82X_GPIO_FUNC_SPI0_SSEL3

/** \brief SPI1_SCK   功能 */
#define PIO_FUNC_SPI1_SCK        AM_LPC82X_GPIO_FUNC_SPI1_SCK

/** \brief SPI1_MOSI  功能 */
#define PIO_FUNC_SPI1_MOSI       AM_LPC82X_GPIO_FUNC_SPI1_MOSI

/** \brief SPI1_MISO  功能 */
#define PIO_FUNC_SPI1_MISO       AM_LPC82X_GPIO_FUNC_SPI1_MISO

/** \brief SPI1_SSEL0 功能 */
#define PIO_FUNC_SPI1_SSEL0      AM_LPC82X_GPIO_FUNC_SPI1_SSEL0

/** \brief SPI1_SSEL1 功能 */
#define PIO_FUNC_SPI1_SSEL1      AM_LPC82X_GPIO_FUNC_SPI1_SSEL1

/** \brief SCT_PIN_PIN0 功能 */
#define PIO_FUNC_SCT_PIN0        AM_LPC82X_GPIO_FUNC_SCT_PIN0

/** \brief SCT_PIN_PIN1 功能 */
#define PIO_FUNC_SCT_PIN1        AM_LPC82X_GPIO_FUNC_SCT_PIN1

/** \brief SCT_PIN_PIN2 功能 */
#define PIO_FUNC_SCT_PIN2        AM_LPC82X_GPIO_FUNC_SCT_PIN2

/** \brief SCT_PIN_PIN3 功能 */
#define PIO_FUNC_SCT_PIN3        AM_LPC82X_GPIO_FUNC_SCT_PIN3

/** \brief SCT_OUT0 功能 */
#define PIO_FUNC_SCT_OUT0        AM_LPC82X_GPIO_FUNC_SCT_OUT0

/** \brief SCT_OUT1 功能 */
#define PIO_FUNC_SCT_OUT1        AM_LPC82X_GPIO_FUNC_SCT_OUT1

