zohar123/ametal/soc/nxp/lpc824/lpc82x_pin.h
/** \brief SCT_OUT2 功能 */
#define PIO_FUNC_SCT_OUT2        AM_LPC82X_GPIO_FUNC_SCT_OUT2

/** \brief SCT_OUT3 功能 */
#define PIO_FUNC_SCT_OUT3        AM_LPC82X_GPIO_FUNC_SCT_OUT3

/** \brief SCT_OUT4 功能 */
#define PIO_FUNC_SCT_OUT4        AM_LPC82X_GPIO_FUNC_SCT_OUT4

/** \brief SCT_OUT5 功能 */
#define PIO_FUNC_SCT_OUT5        AM_LPC82X_GPIO_FUNC_SCT_OUT5

/** \brief I2C1_SDA 功能 */
#define PIO_FUNC_I2C1_SDA        AM_LPC82X_GPIO_FUNC_I2C1_SDA

/** \brief I2C1_SCL 功能 */
#define PIO_FUNC_I2C1_SCL        AM_LPC82X_GPIO_FUNC_I2C1_SCL

/** \brief I2C2_SDA 功能 */
#define PIO_FUNC_I2C2_SDA        AM_LPC82X_GPIO_FUNC_I2C2_SDA

/** \brief I2C2_SCL 功能 */
#define PIO_FUNC_I2C2_SCL        AM_LPC82X_GPIO_FUNC_I2C2_SCL

/** \brief I2C3_SDA 功能 */
#define PIO_FUNC_I2C3_SDA        AM_LPC82X_GPIO_FUNC_I2C3_SDA

/** \brief I2C3_SCL 功能 */
#define PIO_FUNC_I2C3_SCL        AM_LPC82X_GPIO_FUNC_I2C3_SCL

/** \brief ADC_PINTRIG0 功能 */
#define PIO_FUNC_ADC_PINTRIG0    AM_LPC82X_GPIO_FUNC_ADC_PINTRIG0

/** \brief ADC_PINTRIG1 功能 */
#define PIO_FUNC_ADC_PINTRIG1    AM_LPC82X_GPIO_FUNC_ADC_PINTRIG1

/** \brief ACMP 功能 */
#define PIO_FUNC_ACMP_O          AM_LPC82X_GPIO_FUNC_ACMP_O

/** \brief CLKOUT 功能 */

#define PIO_FUNC_CLKOUT          AM_LPC82X_GPIO_FUNC_CLKOUT
  
/** \brief GPIO_INT_BMAT 功能 */
#define PIO_FUNC_GPIO_INT_BMAT   AM_LPC82X_GPIO_FUNC_GPIO_INT_BMAT

/** @} */

/******************************************************************************/

/**
 * \name PIO0_0 固定功能
 * @{
 */

#define PIO0_0_GPIO        AM_LPC82X_GPIO_FUNC_GPIO     /**< \brief GPIO     */
#define PIO0_0_ACMP_I1     AM_LPC82X_GPIO_FUNC_OTHER1   /**< \brief ACMP_I1  */

/** @} */

/**
 * \name PIO0_0 GPIO方向
 * @{
 */
 
#define PIO0_0_GPIO_INPUT             AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_0_GPIO_OUTPUT_INIT_HIGH  AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_0_GPIO_OUTPUT_INIT_LOW   AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_0 引脚模式
 * @{
 */

#define PIO0_0_INACTIVE    AM_LPC82X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO0_0_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO0_0_PULLUP      AM_LPC82X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO0_0_REPEATER    AM_LPC82X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO0_0_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_0 输入极性
 * @{
 */
 
#define PIO0_0_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO0_0_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO0_0 迟滞
 * @{
 */
#define PIO0_0_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO0_0_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO0_0 滤波周期
 * @{
 */
 
#define PIO0_0_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO0_0_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO0_0_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO0_0_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_0 滤波分频
 * @{
 */
 
#define PIO0_0_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO0_0_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO0_0_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO0_0_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO0_0_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO0_0_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO0_0_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_1 固定功能
 * @{
 */

#define PIO0_1_GPIO        AM_LPC82X_GPIO_FUNC_GPIO     /**< \brief GPIO     */
#define PIO0_1_ACMP_I2     AM_LPC82X_GPIO_FUNC_OTHER1   /**< \brief ACMP_I2  */
#define PIO0_1_CLKIN       AM_LPC82X_GPIO_FUNC_OTHER2   /**< \brief CLKIN    */

/** @} */

/**
 * \name PIO0_1 GPIO方向
 * @{
 */
 
#define PIO0_1_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_1_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_1_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_1 引脚模式
 * @{
 */

#define PIO0_1_INACTIVE    AM_LPC82X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO0_1_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO0_1_PULLUP      AM_LPC82X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO0_1_REPEATER    AM_LPC82X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO0_1_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_1 输入极性
 * @{
 */

#define PIO0_1_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO0_1_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO0_1 迟滞
 * @{
 */
#define PIO0_1_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO0_1_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO0_1 滤波周期
 * @{
 */
 
#define PIO0_1_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO0_1_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO0_1_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO0_1_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_1 滤波分频
 * @{
 */
 
#define PIO0_1_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO0_1_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO0_1_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO0_1_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO0_1_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO0_1_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO0_1_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_2 固定功能
 * @{
 */

