zohar123/ametal/soc/nxp/lpc824/lpc82x_pin.h
#define PIO0_2_GPIO        AM_LPC82X_GPIO_FUNC_GPIO     /**< \brief GPIO     */
#define PIO0_2_SWDIO       AM_LPC82X_GPIO_FUNC_OTHER1   /**< \brief SWDIO    */

/** @} */

/**
 * \name PIO0_2 GPIO方向
 * @{
 */

#define PIO0_2_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_2_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_2_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_2 引脚模式
 * @{
 */

#define PIO0_2_INACTIVE    AM_LPC82X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO0_2_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO0_2_PULLUP      AM_LPC82X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO0_2_REPEATER    AM_LPC82X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO0_2_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_2 输入极性
 * @{
 */

#define PIO0_2_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO0_2_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO0_2 迟滞
 * @{
 */
#define PIO0_2_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO0_2_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO0_2 滤波周期
 * @{
 */

#define PIO0_2_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO0_2_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO0_2_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO0_2_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_2 滤波分频
 * @{
 */

#define PIO0_2_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO0_2_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO0_2_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO0_2_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO0_2_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO0_2_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO0_2_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_3 固定功能
 * @{
 */

#define PIO0_3_GPIO        AM_LPC82X_GPIO_FUNC_GPIO     /**< \brief GPIO     */
#define PIO0_3_SWCLK       AM_LPC82X_GPIO_FUNC_OTHER1   /**< \brief SWCLK    */

/** @} */

/**
 * \name PIO0_3 GPIO方向
 * @{
 */
 
#define PIO0_3_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_3_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_3_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_3 引脚模式
 * @{
 */

#define PIO0_3_INACTIVE    AM_LPC82X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO0_3_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO0_3_PULLUP      AM_LPC82X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO0_3_REPEATER    AM_LPC82X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO0_3_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_3 输入极性
 * @{
 */

#define PIO0_3_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO0_3_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO0_3 迟滞
 * @{
 */
#define PIO0_3_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO0_3_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO0_3 滤波周期
 * @{
 */

#define PIO0_3_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE  /**< \brief 滤波禁能  */
#define PIO0_3_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE   /**< \brief 滤波1周期 */
#define PIO0_3_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE   /**< \brief 滤波2周期 */
#define PIO0_3_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE   /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_3 滤波分频
 * @{
 */

#define PIO0_3_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0     /**< \brief 分频值为0 */
#define PIO0_3_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1     /**< \brief 分频值为1 */
#define PIO0_3_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2     /**< \brief 分频值为2 */
#define PIO0_3_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3     /**< \brief 分频值为3 */
#define PIO0_3_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4     /**< \brief 分频值为4 */
#define PIO0_3_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5     /**< \brief 分频值为5 */
#define PIO0_3_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6     /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_4 固定功能
 * @{
 */

#define PIO0_4_GPIO        AM_LPC82X_GPIO_FUNC_GPIO     /**< \brief GPIO     */
#define PIO0_4_ADC_11      AM_LPC82X_GPIO_FUNC_OTHER1   /**< \brief ADC_11   */

/** @} */

/**
 * \name PIO0_4 GPIO方向
 * @{
 */

#define PIO0_4_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_4_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_4_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_4 引脚模式
 * @{
 */

#define PIO0_4_INACTIVE    AM_LPC82X_GPIO_INACTIVE      /**< \brief 消极模式 */
#define PIO0_4_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN      /**< \brief 下拉模式 */
#define PIO0_4_PULLUP      AM_LPC82X_GPIO_PULLUP        /**< \brief 上拉模式 */
#define PIO0_4_REPEATER    AM_LPC82X_GPIO_REPEATER      /**< \brief 中继模式 */
#define PIO0_4_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN    /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_4 输入极性
 * @{
 */

#define PIO0_4_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转    */
#define PIO0_4_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转      */

/** @} */

/**
 * \name PIO0_4 迟滞
 * @{
 */
#define PIO0_4_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启    */
#define PIO0_4_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启      */

/** @} */

/**
 * \name PIO0_4 滤波周期
 * @{
 */

