zohar123/ametal/soc/nxp/lpc824/lpc82x_pin.h
#define PIO0_13_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_13_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_13_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_13 引脚模式
 * @{
 */

#define PIO0_13_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_13_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_13_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_13_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_13_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_13 输入极性
 * @{
 */

#define PIO0_13_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_13_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_13 迟滞
 * @{
 */

#define PIO0_13_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_13_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_13 滤波周期
 * @{
 */

#define PIO0_13_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_13_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_13_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_13_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_13 滤波分频
 * @{
 */

#define PIO0_13_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_13_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_13_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_13_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_13_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_13_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_13_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_14 固定功能
 * @{
 */

#define PIO0_14_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO0_14_ACMP_I3     AM_LPC82X_GPIO_FUNC_OTHER1  /**< \brief ACMP_I3  */
#define PIO0_14_ADC_2       AM_LPC82X_GPIO_FUNC_OTHER2  /**< \brief ADC_2    */

/** @} */

/**
 * \name PIO0_14 GPIO方向
 * @{
 */

#define PIO0_14_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_14_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_14_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_14 引脚模式
 * @{
 */

#define PIO0_14_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_14_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_14_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_14_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_14_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_14 输入极性
 * @{
 */

#define PIO0_14_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_14_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_14 迟滞
 * @{
 */

#define PIO0_14_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_14_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_14 滤波周期
 * @{
 */

#define PIO0_14_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_14_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_14_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_14_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_14 滤波分频
 * @{
 */

#define PIO0_14_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_14_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_14_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_14_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_14_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_14_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_14_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_15 固定功能
 * @{
 */

#define PIO0_15_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO0_15 GPIO方向
 * @{
 */

#define PIO0_15_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_15_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_15_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_15 引脚模式
 * @{
 */

#define PIO0_15_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_15_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_15_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_15_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_15_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_15 输入极性
 * @{
 */

#define PIO0_15_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_15_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_15 迟滞
 * @{
 */

#define PIO0_15_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_15_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_15 滤波周期
 * @{
 */

#define PIO0_15_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_15_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_15_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_15_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_15 滤波分频
 * @{
 */

#define PIO0_15_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_15_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_15_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_15_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_15_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_15_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_15_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_16 固定功能
 * @{
 */

#define PIO0_16_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO0_16 GPIO方向
 * @{
 */

#define PIO0_16_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_16_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_16_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_16 引脚模式
 * @{
 */

#define PIO0_16_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_16_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_16_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_16_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_16_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_16 输入极性
 * @{
 */

#define PIO0_16_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_16_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_16 迟滞
 * @{
 */

#define PIO0_16_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_16_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_16 滤波周期
 * @{
 */

#define PIO0_16_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_16_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_16_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_16_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_16 滤波分频
 * @{
 */

#define PIO0_16_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_16_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_16_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_16_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_16_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_16_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_16_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_17 固定功能
 * @{
 */

#define PIO0_17_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO0_17_ADC_9       AM_LPC82X_GPIO_FUNC_OTHER1  /**< \brief ADC_9    */

/** @} */

/**
 * \name PIO0_17 GPIO方向
 * @{
 */

#define PIO0_17_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_17_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_17_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_17 引脚模式
 * @{
 */

#define PIO0_17_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_17_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_17_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_17_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_17_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_17 输入极性
 * @{
 */

