zohar123/ametal/soc/nxp/lpc824/lpc82x_pin.h
#define PIO0_22_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_22_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_22_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_22_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_22 滤波分频
 * @{
 */

#define PIO0_22_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_22_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_22_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_22_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_22_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_22_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_22_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_23 固定功能
 * @{
 */

#define PIO0_23_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */
#define PIO0_23_ACMP_I4     AM_LPC82X_GPIO_FUNC_OTHER1  /**< \brief ACMP_I4  */
#define PIO0_23_ADC_3       AM_LPC82X_GPIO_FUNC_OTHER2  /**< \brief ADC_3    */

/** @} */

/**
 * \name PIO0_23 GPIO方向
 * @{
 */

#define PIO0_23_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_23_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_23_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_23 引脚模式
 * @{
 */

#define PIO0_23_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_23_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_23_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_23_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_23_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_23 输入极性
 * @{
 */

#define PIO0_23_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_23_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_23 迟滞
 * @{
 */

#define PIO0_23_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_23_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_23 滤波周期
 * @{
 */

#define PIO0_23_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_23_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_23_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_23_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_23 滤波分频
 * @{
 */

#define PIO0_23_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_23_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_23_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_23_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_23_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_23_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_23_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_24 固定功能
 * @{
 */

#define PIO0_24_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO0_24 GPIO方向
 * @{
 */

#define PIO0_24_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_24_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_24_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_24 引脚模式
 * @{
 */

#define PIO0_24_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_24_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_24_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_24_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_24_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_24 输入极性
 * @{
 */
 
#define PIO0_24_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_24_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_24 迟滞
 * @{
 */

#define PIO0_24_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_24_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_24 滤波周期
 * @{
 */

#define PIO0_24_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_24_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_24_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_24_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_24 滤波分频
 * @{
 */

#define PIO0_24_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_24_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_24_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_24_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_24_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_24_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_24_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_25 固定功能
 * @{
 */

#define PIO0_25_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO0_25 GPIO方向
 * @{
 */
#define PIO0_25_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_25_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_25_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_25 引脚模式
 * @{
 */

#define PIO0_25_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_25_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_25_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_25_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_25_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_25 输入极性
 * @{
 */

#define PIO0_25_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_25_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_25 迟滞
 * @{
 */

#define PIO0_25_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_25_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_25 滤波周期
 * @{
 */

#define PIO0_25_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_25_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_25_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_25_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_25 滤波分频
 * @{
 */

#define PIO0_25_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_25_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_25_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_25_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_25_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_25_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_25_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_26 固定功能
 * @{
 */

#define PIO0_26_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO0_26 GPIO方向
 * @{
 */
 
#define PIO0_26_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_26_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_26_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_26 引脚模式
 * @{
 */

#define PIO0_26_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_26_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_26_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_26_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_26_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_26 输入极性
 * @{
 */

#define PIO0_26_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_26_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_26 迟滞
 * @{
 */

