zohar123/ametal/soc/nxp/lpc824/lpc82x_pin.h
#define PIO0_26_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_26_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_26 滤波周期
 * @{
 */

#define PIO0_26_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_26_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_26_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_26_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_26 滤波分频
 * @{
 */

#define PIO0_26_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_26_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_26_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_26_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_26_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_26_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_26_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_27 固定功能
 * @{
 */

#define PIO0_27_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO0_27 GPIO方向
 * @{
 */

#define PIO0_27_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_27_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_27_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_27 引脚模式
 * @{
 */

#define PIO0_27_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_27_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_27_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_27_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_27_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_27 输入极性
 * @{
 */

#define PIO0_27_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_27_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_27 迟滞
 * @{
 */

#define PIO0_27_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_27_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_27 滤波周期
 * @{
 */

#define PIO0_27_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_27_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_27_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_27_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_27 滤波分频
 * @{
 */

#define PIO0_27_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_27_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_27_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_27_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_27_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_27_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_27_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */

/******************************************************************************/

/**
 * \name PIO0_28 固定功能
 * @{
 */

#define PIO0_28_GPIO        AM_LPC82X_GPIO_FUNC_GPIO    /**< \brief GPIO     */

/** @} */

/**
 * \name PIO0_28 GPIO方向
 * @{
 */

#define PIO0_28_GPIO_INPUT            AM_LPC82X_GPIO_INPUT       /**< \brief 输入   */
#define PIO0_28_GPIO_OUTPUT_INIT_HIGH AM_LPC82X_GPIO_OUTPUT_HIGH /**< \brief 输出高 */
#define PIO0_28_GPIO_OUTPUT_INIT_LOW  AM_LPC82X_GPIO_OUTPUT_LOW  /**< \brief 输出低 */

/** @} */

/**
 * \name PIO0_28 引脚模式
 * @{
 */

#define PIO0_28_INACTIVE    AM_LPC82X_GPIO_INACTIVE     /**< \brief 消极模式 */
#define PIO0_28_PULLDOWN    AM_LPC82X_GPIO_PULLDOWN     /**< \brief 下拉模式 */
#define PIO0_28_PULLUP      AM_LPC82X_GPIO_PULLUP       /**< \brief 上拉模式 */
#define PIO0_28_REPEATER    AM_LPC82X_GPIO_REPEATER     /**< \brief 中继模式 */
#define PIO0_28_OPEN_DRAIN  AM_LPC82X_GPIO_OPEN_DRAIN   /**< \brief 开漏模式 */

/** @} */

/**
 * \name PIO0_28 输入极性
 * @{
 */

#define PIO0_28_INV_DISABLE AM_LPC82X_GPIO_INV_DISABLE  /**< \brief 不反转   */
#define PIO0_28_INV_ENABLE  AM_LPC82X_GPIO_INV_ENABLE   /**< \brief 反转     */

/** @} */

/**
 * \name PIO0_28 迟滞
 * @{
 */

#define PIO0_28_HYS_DISABLE AM_LPC82X_GPIO_HYS_DISABLE  /**< \brief 不开启   */
#define PIO0_28_HYS_ENABLE  AM_LPC82X_GPIO_HYS_ENABLE   /**< \brief 开启     */

/** @} */

/**
 * \name PIO0_28 滤波周期
 * @{
 */

#define PIO0_28_FIL_DISABLE AM_LPC82X_GPIO_FIL_DISABLE /**< \brief 滤波禁能  */
#define PIO0_28_FIL_1CYCLE  AM_LPC82X_GPIO_FIL_1CYCLE  /**< \brief 滤波1周期 */
#define PIO0_28_FIL_2CYCLE  AM_LPC82X_GPIO_FIL_2CYCLE  /**< \brief 滤波2周期 */
#define PIO0_28_FIL_3CYCLE  AM_LPC82X_GPIO_FIL_3CYCLE  /**< \brief 滤波3周期 */

/** @} */

/**
 * \name PIO0_28 滤波分频
 * @{
 */

#define PIO0_28_FIL_DIV0    AM_LPC82X_GPIO_FIL_DIV0    /**< \brief 分频值为0 */
#define PIO0_28_FIL_DIV1    AM_LPC82X_GPIO_FIL_DIV1    /**< \brief 分频值为1 */
#define PIO0_28_FIL_DIV2    AM_LPC82X_GPIO_FIL_DIV2    /**< \brief 分频值为2 */
#define PIO0_28_FIL_DIV3    AM_LPC82X_GPIO_FIL_DIV3    /**< \brief 分频值为3 */
#define PIO0_28_FIL_DIV4    AM_LPC82X_GPIO_FIL_DIV4    /**< \brief 分频值为4 */
#define PIO0_28_FIL_DIV5    AM_LPC82X_GPIO_FIL_DIV5    /**< \brief 分频值为5 */
#define PIO0_28_FIL_DIV6    AM_LPC82X_GPIO_FIL_DIV6    /**< \brief 分频值为6 */

/** @} */


/**
 * @} lpc82x_if_pin
 */

#ifdef __cplusplus
}
#endif

#endif /* __LPC82X_PIN_H */

/* end of file */
